app/controllers/posts_controller.rb

  def index
    @posts = Post.all  # すべてのレコードを@postsに代入
---
SELECT `posts`.* FROM `posts`