app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order(id: "DESC")  # すべてのレコードを@postsに代入
---
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`id` DESC

  def create
    Post.create(content: params[:content])
---
INSERT INTO `posts` (`content`, `created_at`, `updated_at`) VALUES ('時には誰かを', '2020-07-30 06:39:34.089546', '2020-07-30 06:39:34.089546')

  def checked
    post = Post.find(params[:id])
    if post.checked then
      post.update(checked: false)
    else
      post.update(checked: true)
    end

    item = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 7 LIMIT 1
UPDATE `posts` SET `posts`.`checked` = FALSE, `posts`.`updated_at` = '2020-07-30 07:33:49.350287' WHERE `posts`.`id` = 7
UPDATE `posts` SET `posts`.`checked` = TRUE, `posts`.`updated_at` = '2020-07-30 07:33:49.075094' WHERE `posts`.`id` = 7